dropyourcoffee/poc_Nrf52Lsm6ds3/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
    uint8_t  start_string[] = START_STRING;
    
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    
	 
		printf("%s",MSG_LINE);
		printf("%s",start_string);
		printf("\n");
		printf("%s",MID_LINE);

    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    
	  err_code = twi_master_init();
    APP_ERROR_CHECK(err_code);
	printf("twi_master Initialised\n");
		
    // Enter main loop.
    for (;;)
    {
      uint8_t c = 0;
			while(c == 0)
        {
            if(mpu_rdy){
							printf("accelx : %2.4f\n",data.accel.x);
						}
						
						c = getchar();
        }
        switch((char)c)
        {
        case '\n':
        case '\r':
            break;
        case 'p':
            printf("p\n");
						func1();
            break;
        case 'l':
            toggleMPU_RDY();
            break;
        case 'c':
            readData();
            break;
        default:
            printf("You selected %c\n", (char)c);
            break;
        }
				//power_manage();
        }
		
 
}// end main


/** 
 * @}
 */


void func1(void){
	printf("func1()\n");
	printf("mpu6050 Default Address : 0x%.4x\n",MPU6050_DEFAULT_ADDRESS);
	write_register(MPU6050_RA_PWR_MGMT_1,  1);
	uint8_t rd;
	read_register(MPU6050_RA_PWR_MGMT_1,  &rd);
	
	write_register(MPU6050_RA_GYRO_CONFIG,  MPU6050_GYRO_FS_250<<3); // Gyro Config Addr : 0x1B
	write_register(MPU6050_RA_ACCEL_CONFIG,  MPU6050_ACCEL_FS_2<<3); // Accel Config Addr : 0x1C
	
	I2CwriteBit(MPU6050_DEFAULT_ADDRESS, MPU6050_RA_PWR_MGMT_1, MPU6050_PWR1_SLEEP_BIT, false);
	
	// Test Connection
	read_register(MPU6050_RA_WHO_AM_I,  &rd);
	printf("Test Connection.. %s\n", (rd==MPU6050_DEFAULT_ADDRESS)?"Successful":"Failed" );
	
	
	
	
}

void readData(){
	uint8_t tmp;
	int16_t val;
	read_register(MPU6050_RA_ACCEL_XOUT_H, &tmp);
	val = tmp;
	read_register(MPU6050_RA_ACCEL_XOUT_L, &tmp);
	val = (val<<8) +tmp;
	
	data.accel.x = (float)val;
//	printf("raw hex : %.4x\n",val);
	data.accel.x = data.accel.x / 1668.4f ;
	
	char data_wr[20];
	sprintf(data_wr,"%2.4f",data.accel.x);
	ble_nus_string_send(&m_nus, data_wr, 5);
	
}

void toggleMPU_RDY(){
		mpu_rdy = !mpu_rdy;
}

static ret_code_t read_register(size_t addr, uint8_t * pdata){
	 ret_code_t ret;
    int i = 0;
		do
    {
       uint8_t addr8 = (uint8_t)addr;
       ret = nrf_drv_twi_tx(&m_twi_master, MPU6050_DEFAULT_ADDRESS, &addr8, 1, true);
       if(NRF_SUCCESS != ret)
       {
          
				 break;
       }
       ret = nrf_drv_twi_rx(&m_twi_master, MPU6050_DEFAULT_ADDRESS, pdata,1, false);
			 i++;
    }while(0);
		
    return ret;
}

static ret_code_t write_register(size_t addr, uint8_t pdata)
{
    ret_code_t ret;
		printf("writing %02x on REG %02x..\n",pdata,addr);
    do
    {
        uint8_t addr8 = (uint8_t)addr;
        ret = nrf_drv_twi_tx(&m_twi_master, MPU6050_DEFAULT_ADDRESS, &addr8, 1, true);
        if(NRF_SUCCESS != ret)
        {
            break;
        }
        ret = nrf_drv_twi_tx(&m_twi_master, MPU6050_DEFAULT_ADDRESS, &pdata, 1, false);
    }while(0);
    return ret;
}

ret_code_t I2CwriteBits(uint8_t devAddr, uint8_t regAddr, uint8_t bitStart, uint8_t length, uint8_t data) {

		uint8_t b;
	
    if (read_register(regAddr, &b) != 0) {
        uint8_t mask = ((1 << length) - 1) << (bitStart - length + 1);
        data <<= (bitStart - length + 1); // shift data into correct position
        data &= mask; // zero all non-important bits in data
        b &= ~(mask); // zero all important bits in existing byte
        b |= data; // combine data with existing byte
        return write_register(regAddr, b);
    } else {
        return NRF_ERROR_NULL;
    }
}

ret_code_t I2CwriteBit(uint8_t devAddr, uint8_t regAddr, uint8_t bitNum, uint8_t data) {
    uint8_t b;
    read_register(regAddr, &b);
    b = (data != 0) ? (b | (1 << bitNum)) : (b & ~(1 << bitNum));
    return write_register(regAddr, b);
}



static ret_code_t twi_master_init(void)
{
    ret_code_t ret;
    const nrf_drv_twi_config_t config =
    {
       .scl                = TWI_SCL_M,
       .sda                = TWI_SDA_M,
       .frequency          = NRF_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH
    };

    do
    {
        ret = nrf_drv_twi_init(&m_twi_master, &config, NULL);
        if(NRF_SUCCESS != ret)
        {
            break;
        }
        nrf_drv_twi_enable(&m_twi_master);
    }while(0);
    return ret;
}